# Используем официальный образ Golang в качестве базового образа
FROM golang:latest

# Установка рабочей директории внутри контейнера
WORKDIR /app

# Копируем файлы вашего приложения и файла зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем исходный код вашего приложения в контейнер
COPY . .

# Собираем ваше приложение
RUN go build -o app

# Используем официальный образ Alpine Linux в качестве базового образа для минимизации размера
FROM alpine:latest

# Устанавливаем SQLite
RUN apk --no-cache add sqlite

# Устанавливаем C-библиотеку, необходимую для работы SQLite
RUN apk add gcc

# Создаем директорию для хранения базы данных SQLite
RUN mkdir /data

# Копируем скомпилированное приложение из предыдущего этапа
COPY --from=0 /app/app /app

# Устанавливаем переменную окружения для указания местоположения базы данных SQLite
ENV DB_PATH=/data/mydb.sqlite

# Устанавливаем рабочую директорию
WORKDIR /app

# Запускаем ваше приложение
CMD ["./app"]
